run/simpleBattery_copy/Allrun
#!/bin/sh

bash ./runParaBField.sh
bash ./runParaRatio.sh
